In [1]:
import pandas as pd # importa a biblioteca pandas

In [2]:
Dicionario_01={
    'ID':[1,2,3,4],
    'Nome':["Ana","Pedro","Maria","Murilo"],
    'Setores':["Rh","Vendas","Administrativo","Produção"]
}
Dicionario_02={
    'ID':[1,2,3,4],
    'Salarios':[3000,2800,3200,2500]
    }

In [3]:
df1 = pd.DataFrame(Dicionario_01)
df2 = pd.DataFrame(Dicionario_02)

In [7]:
df_n1 = pd.merge(df1,df2,how='inner', on ='ID')

In [8]:
df_n1.head()

   ID    Nome         Setores  Salarios
0   1     Ana              Rh      3000
1   2   Pedro          Vendas      2800
2   3   Maria  Administrativo      3200
3   4  Murilo        Produção      2500